<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Maji Ndogo Water Crisis
© ExploreAI Academy

The **water crisis** faced by a fictitious **country** called **Maji Ndogo**.

> ⚠️ This notebook cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `md_water_services` database.

## Connecting to our MySQL database

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:3327753@localhost:3306/md_water_services

'Connected: root@md_water_services'

# Integrated Project Maji Ndogo Part 1

### Task 1: Get to know our data

In [96]:
%%sql

SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
12 rows affected.

[('auditor_report',),
 ('combined_analysis_table',),
 ('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('incorrect_records',),
 ('location',),
 ('project_progress',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [97]:
%%sql

SELECT *
FROM location
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00003', '139 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00004', '17 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00005', '125 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00006', '98 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00007', '21 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00008', '11 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00009', '6 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

### Task 2: Dive into the water sources

In [98]:
%%sql

SELECT DISTINCT type_of_water_source
FROM water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home',),
 ('tap_in_home_broken',),
 ('well',),
 ('shared_tap',),
 ('river',)]

### Task 3: Unpack the visits to water sources

In [80]:
%%sql

SELECT * 
FROM visits
WHERE time_in_queue > 500
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(899, 'SoRu35083', 'SoRu35083224', datetime.datetime(2021, 1, 16, 10, 14), 6, 515, 28),
 (2304, 'SoKo33124', 'SoKo33124224', datetime.datetime(2021, 2, 6, 7, 53), 5, 512, 16),
 (2315, 'KiRu26095', 'KiRu26095224', datetime.datetime(2021, 2, 6, 14, 32), 3, 529, 8),
 (3206, 'SoRu38776', 'SoRu38776224', datetime.datetime(2021, 2, 20, 15, 3), 5, 509, 46),
 (3701, 'HaRu19601', 'HaRu19601224', datetime.datetime(2021, 2, 27, 12, 53), 3, 504, 0)]

### Task 4: Assess the quality of water sources

In [79]:
%%sql

SELECT *
FROM water_quality
WHERE subjective_quality_score = 10
    AND visit_count = 2
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[(59, 10, 2),
 (137, 10, 2),
 (269, 10, 2),
 (363, 10, 2),
 (378, 10, 2),
 (618, 10, 2),
 (752, 10, 2),
 (801, 10, 2),
 (819, 10, 2),
 (850, 10, 2)]

### Task 5: Investigate pollution issues:

In [101]:
%%sql

SELECT *
FROM well_pollution
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical'),
 ('HaRu19725224', datetime.datetime(2021, 1, 4, 11, 4), 'Clean', 0.0288593, 9.56996e-05, 'Clean'),
 ('SoRu35703224', datetime.datetime(2021, 1, 4, 11, 29), 'Bacteria: E. coli', 0.0, 22.5009, 'Contaminated: Biological')]

In [102]:
%%sql

SELECT *
FROM well_pollution
WHERE results = "Clean"
    AND biological > 0.01
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [103]:
%%sql

SELECT *
FROM well_pollution
WHERE description LIKE "%Clean_%";

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [104]:
%%sql

UPDATE well_pollution
SET description = 'Bacteria: E. coli'
WHERE description = 'Clean Bacteria: E. coli';
UPDATE well_pollution
SET description = 'Bacteria: Giardia Lamblia'
WHERE description = 'Clean Bacteria: Giardia Lamblia';
UPDATE well_pollution
SET description = 'Contaminated: Biological'
WHERE biological > 0.01
    AND results = 'Clean';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [105]:
%%sql

SELECT *
FROM well_pollution
WHERE description LIKE "Clean_%"
    OR (results = "Clean" AND biological > 0.01);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

# Integrated Project Maji Ndogo Part 2

### Task 1: Cleaning our data

In [81]:
%%sql

SELECT
    employee_name,
    CONCAT(LOWER
           (REPLACE(employee_name," ",".")),"@ndogowater.gov"
    ) AS new_email
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amara Jengo', 'amara.jengo@ndogowater.gov'),
 ('Bello Azibo', 'bello.azibo@ndogowater.gov'),
 ('Bakari Iniko', 'bakari.iniko@ndogowater.gov'),
 ('Malachi Mavuso', 'malachi.mavuso@ndogowater.gov'),
 ('Cheche Buhle', 'cheche.buhle@ndogowater.gov')]

In [107]:
%%sql

UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name," ",".")),"@ndogowater.gov");

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [82]:
%%sql

SELECT LENGTH(phone_number),
    LENGTH(TRIM(phone_number)) AS trimmed_length
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(12, 12), (12, 12), (12, 12), (12, 12), (12, 12)]

In [109]:
%%sql

UPDATE employee
SET phone_number = TRIM(phone_number);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

### Task 2: Honouring the worker

In [83]:
%%sql

SELECT town_name,
    COUNT(*) AS num_employees
FROM employee
GROUP BY town_name
ORDER BY num_employees DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Rural', 29), ('Dahabu', 6), ('Harare', 5), ('Lusaka', 4), ('Zanzibar', 4)]

In [111]:
%%sql

SELECT assigned_employee_id,
    COUNT(*) AS num_of_visits
FROM visits
GROUP BY assigned_employee_id
ORDER BY num_of_visits DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]

In [86]:
%%sql

SELECT assigned_employee_id,
    employee_name,
    email,
    phone_number
FROM employee
WHERE assigned_employee_id IN (1, 30, 34);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 'Bello Azibo', 'bello.azibo@ndogowater.gov', '+99643864786'),
 (30, 'Pili Zola', 'pili.zola@ndogowater.gov', '+99822478933'),
 (34, 'Rudo Imani', 'rudo.imani@ndogowater.gov', '+99046972648')]

### Task 3: Analysing locations

In [87]:
%%sql

SELECT
    town_name,
    COUNT(*) AS records_per_town
FROM location
GROUP BY town_name
ORDER BY records_per_town DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Rural', 23740),
 ('Harare', 1650),
 ('Amina', 1090),
 ('Lusaka', 1070),
 ('Mrembo', 990)]

In [90]:
%%sql

SELECT
    province_name,
    COUNT(*) AS records_per_province
FROM location
GROUP BY province_name
ORDER BY records_per_province DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Kilimani', 9510),
 ('Akatsi', 8940),
 ('Sokoto', 8220),
 ('Amanzi', 6950),
 ('Hawassa', 6030)]

In [91]:
%%sql

SELECT DISTINCT province_name,
    town_name,
    COUNT(location_type) OVER (Partition by province_name,
    town_name ORDER BY province_name) AS records_per_town
FROM location
ORDER BY province_name, records_per_town DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100)]

In [116]:
%%sql

SELECT location_type,
    COUNT(location_type) AS num_of_sources
FROM location
GROUP BY location_type;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('Urban', 15910), ('Rural', 23740)]

In [117]:
%%sql

SELECT 23740 / (15910 + 23740) * 100

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('59.8739'),)]

### Task 4: Diving into the sources

In [118]:
%%sql

SELECT SUM(number_of_people_served) AS total_no_of_people_surveyed
FROM water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

In [119]:
%%sql

SELECT type_of_water_source,
    COUNT(type_of_water_source) As count_per_source_type
FROM water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

In [120]:
%%sql

SELECT type_of_water_source,
    ROUND(AVG(number_of_people_served)) AS avg_num_of_ppl_served
FROM water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

In [121]:
%%sql

SELECT type_of_water_source,
    SUM(number_of_people_served) AS total_pop_served
FROM water_source
GROUP BY type_of_water_source
ORDER BY total_pop_served DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [122]:
%%sql 

SELECT type_of_water_source,
    ROUND((SUM(number_of_people_served) / 
         (SELECT SUM(number_of_people_served) FROM water_source)) * 100) AS percentage_of_total
FROM water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('17')),
 ('tap_in_home_broken', Decimal('14')),
 ('well', Decimal('18')),
 ('shared_tap', Decimal('43')),
 ('river', Decimal('9'))]

### Task 5: Start of a solution

In [123]:
%%sql

SELECT type_of_water_source,
    SUM(number_of_people_served) AS total_pop_served,
    RANK() OVER (
        ORDER BY SUM(number_of_people_served) DESC
    ) AS rank_by_population
FROM water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

In [124]:
%%sql

SELECT type_of_water_source,
    SUM(number_of_people_served) AS total_pop_served,
    RANK() OVER (
        ORDER BY SUM(number_of_people_served) DESC
    ) AS rank_by_population
FROM water_source
WHERE type_of_water_source <> "tap_in_home"
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home_broken', Decimal('3799720'), 3),
 ('river', Decimal('2362544'), 4)]

In [92]:
%%sql

SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
    RANK() OVER (
        PARTITION BY type_of_water_source
        ORDER BY number_of_people_served DESC
    ) AS priority_ranking
FROM water_source
WHERE type_of_water_source <> "tap_in_home"
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34798224', 'river', 998, 1),
 ('SoRu35837224', 'river', 998, 1),
 ('SoRu36238224', 'river', 998, 1),
 ('SoRu36791224', 'river', 998, 1),
 ('SoRu36880224', 'river', 998, 1)]

### Task 6: Analysing queues

In [126]:
%%sql

SELECT MIN(time_of_record),
    MAX(time_of_record),
    DATEDIFF(MAX(time_of_record), MIN(time_of_record)) AS survey_duration_in_days
FROM visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(datetime.datetime(2021, 1, 1, 9, 10), datetime.datetime(2023, 7, 14, 13, 53), 924)]

In [127]:
%%sql

SELECT AVG(time_in_queue) AS avg_queue_time_in_mins
FROM visits
WHERE time_in_queue <> 0;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123.2574'),)]

In [128]:
%%sql

SELECT AVG(NULLIF(time_in_queue, 0)) AS avg_queue_time_in_mins
FROM visits

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123.2574'),)]

In [93]:
%%sql

SELECT DAYNAME(time_of_record) AS Day_of_Week,
    ROUND(AVG(time_in_queue),0) AS avg_queue_time_in_mins
FROM visits
WHERE time_in_queue <> 0
GROUP BY Day_of_Week
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Friday', Decimal('120')),
 ('Saturday', Decimal('246')),
 ('Sunday', Decimal('82')),
 ('Monday', Decimal('137')),
 ('Tuesday', Decimal('108'))]

In [94]:
%%sql

SELECT TIME_FORMAT(TIME(time_of_record), "%H:00" ) AS hour_of_day,
    ROUND(AVG(time_in_queue),0) AS avg_queue_time_in_mins
FROM visits
WHERE time_in_queue <> 0
GROUP BY hour_of_day
ORDER BY hour_of_day
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('06:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('08:00', Decimal('149')),
 ('09:00', Decimal('118')),
 ('10:00', Decimal('114'))]

In [95]:
%%sql

SELECT TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    DAYNAME(time_of_record),
    CASE
        WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
        ELSE NULL
    END AS Sunday
FROM visits
WHERE time_in_queue != 0
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('09:00', 'Friday', None),
 ('09:00', 'Friday', None),
 ('10:00', 'Friday', None),
 ('10:00', 'Friday', None),
 ('11:00', 'Friday', None)]

In [96]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    
-- Sunday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Sunday,

-- Monday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Monday,

-- Tuesday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Tuesday,
    
-- Wednesday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Wednesday,
    
-- Thursday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Thursday,
    
-- Friday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Friday,

-- Saturday
    ROUND(AVG(
        CASE
        WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
        ELSE NULL
    END
        ),0) AS Saturday
FROM visits
WHERE time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY hour_of_day
ORDER BY hour_of_day
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259'))]

# Integrated Project Maji Ndogo Part 3

### Task 1: Integrating the Auditor's report

In [136]:
%%sql

SELECT location_id,
    true_water_source_score
FROM auditor_report
ORDER BY location_id
LIMIT 4;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('AkHa00008', 3), ('AkHa00053', 9), ('AkHa00058', 3), ('AkHa00068', 3)]

In [138]:
%%sql

SELECT a.location_id AS audit_location,
    a.true_water_source_score,
    v.location_id AS visit_location,
    v.record_id
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 1, 'SoRu34980', 5185),
 ('AkRu08112', 3, 'AkRu08112', 59367),
 ('AkLu02044', 0, 'AkLu02044', 37379),
 ('AkHa00421', 3, 'AkHa00421', 51627),
 ('SoRu35221', 0, 'SoRu35221', 28758)]

In [97]:
%%sql

SELECT a.location_id AS audit_location,
    a.true_water_source_score,
    v.location_id AS visit_location,
    v.record_id,
    w.subjective_quality_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 1, 'SoRu34980', 5185, 1),
 ('AkRu08112', 3, 'AkRu08112', 59367, 3),
 ('AkLu02044', 0, 'AkLu02044', 37379, 0),
 ('AkHa00421', 3, 'AkHa00421', 51627, 3),
 ('SoRu35221', 0, 'SoRu35221', 28758, 0)]

In [98]:
%%sql

SELECT a.location_id,
    v.record_id,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
WHERE a.true_water_source_score = w.subjective_quality_score
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 5185, 1, 1),
 ('AkRu08112', 59367, 3, 3),
 ('AkLu02044', 37379, 0, 0),
 ('AkHa00421', 51627, 3, 3),
 ('SoRu35221', 28758, 0, 0)]

In [99]:
%%sql
SELECT a.location_id,
    v.record_id,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
WHERE a.true_water_source_score = w.subjective_quality_score
    AND v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 5185, 1, 1),
 ('AkRu08112', 59367, 3, 3),
 ('AkLu02044', 37379, 0, 0),
 ('AkHa00421', 51627, 3, 3),
 ('SoRu35221', 28758, 0, 0)]

In [100]:
%%sql

SELECT a.location_id,
    v.record_id,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
WHERE a.true_water_source_score != w.subjective_quality_score
    AND v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu05215', 21160, 3, 10),
 ('KiRu29290', 7938, 3, 10),
 ('KiHa22748', 43140, 9, 10),
 ('SoRu37841', 18495, 6, 10),
 ('KiRu27884', 33931, 1, 10)]

In [101]:
%%sql

SELECT a.location_id,
    a.type_of_water_source AS auditor_source,
    ws.type_of_water_source AS surveyor_source,
    v.record_id,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE a.true_water_source_score != w.subjective_quality_score
    AND v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu05215', 'well', 'well', 21160, 3, 10),
 ('KiRu29290', 'shared_tap', 'shared_tap', 7938, 3, 10),
 ('KiHa22748', 'tap_in_home_broken', 'tap_in_home_broken', 43140, 9, 10),
 ('SoRu37841', 'shared_tap', 'shared_tap', 18495, 6, 10),
 ('KiRu27884', 'well', 'well', 33931, 1, 10)]

### Task 2: Linking records to employees

In [102]:
%%sql

SELECT a.location_id,
    v.record_id,
    v.assigned_employee_id,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
WHERE a.true_water_source_score != w.subjective_quality_score
    AND v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu05215', 21160, 34, 3, 10),
 ('KiRu29290', 7938, 1, 3, 10),
 ('KiHa22748', 43140, 1, 9, 10),
 ('SoRu37841', 18495, 34, 6, 10),
 ('KiRu27884', 33931, 1, 1, 10)]

In [103]:
%%sql

SELECT a.location_id,
    v.record_id,
    e.employee_name,
    a.true_water_source_score AS auditor_score,
    w.subjective_quality_score AS employee_score
FROM auditor_report a
INNER JOIN visits v
ON a.location_id = v.location_id
INNER JOIN water_quality w
ON w.record_id = v.record_id
INNER JOIN employee e
ON e.assigned_employee_id = v.assigned_employee_id
WHERE a.true_water_source_score != w.subjective_quality_score
    AND v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu05215', 21160, 'Rudo Imani', 3, 10),
 ('KiRu29290', 7938, 'Bello Azibo', 3, 10),
 ('KiHa22748', 43140, 'Bello Azibo', 9, 10),
 ('SoRu37841', 18495, 'Rudo Imani', 6, 10),
 ('KiRu27884', 33931, 'Bello Azibo', 1, 10)]

In [104]:
%%sql

WITH Incorrect_records AS(
    SELECT a.location_id,
        v.record_id,
        e.employee_name,
        a.true_water_source_score AS auditor_score,
        w.subjective_quality_score AS surveyor_score
    FROM auditor_report a
    INNER JOIN visits v
    ON a.location_id = v.location_id
    INNER JOIN water_quality w
    ON w.record_id = v.record_id
    INNER JOIN employee e
    ON e.assigned_employee_id = v.assigned_employee_id
    WHERE a.true_water_source_score != w.subjective_quality_score
        AND v.visit_count = 1
)

SELECT employee_name,
    COUNT(employee_name) AS number_of_mistakes
FROM Incorrect_records
GROUP BY employee_name
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Rudo Imani', 5),
 ('Bello Azibo', 26),
 ('Zuriel Matembo', 17),
 ('Yewande Ebele', 3),
 ('Jengo Tumaini', 3)]

### Task 3: Gathering evidence

In [209]:
%%sql

CREATE VIEW Incorrect_records AS (
    SELECT a.location_id,
        v.record_id,
        e.employee_name,
        a.true_water_source_score AS auditor_score,
        w.subjective_quality_score AS employee_score,
        a.statements AS statements
    FROM auditor_report a
    INNER JOIN visits v
    ON a.location_id = v.location_id
    INNER JOIN water_quality w
    ON w.record_id = v.record_id
    JOIN employee e
    ON e.assigned_employee_id = v.assigned_employee_id
    WHERE a.true_water_source_score != w.subjective_quality_score
        AND v.visit_count = 1);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
(pymysql.err.OperationalError) (1050, "Table 'Incorrect_records' already exists")
[SQL: CREATE VIEW Incorrect_records AS (
    SELECT a.location_id,
        v.record_id,
        e.employee_name,
        a.true_water_source_score AS auditor_score,
        w.subjective_quality_score AS employee_score,
        a.statements AS statements
    FROM auditor_report a
    INNER JOIN visits v
    ON a.location_id = v.location_id
    INNER JOIN water_quality w
    ON w.record_id = v.record_id
    JOIN employee e
    ON e.assigned_employee_id = v.assigned_employee_id
    WHERE a.true_water_source_score != w.subjective_quality_score
        AND v.visit_count = 1);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [201]:
%%sql

WITH error_count AS (
    SELECT employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM Incorrect_records 
    GROUP BY employee_name
    ORDER BY employee_name DESC
)
SELECT employee_name,
    number_of_mistakes
FROM error_count
WHERE number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('Zuriel Matembo', 17),
 ('Malachi Mavuso', 21),
 ('Lalitha Kaburi', 7),
 ('Bello Azibo', 26)]

In [105]:
%%sql

WITH error_count AS (
    SELECT employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM Incorrect_records

GROUP BY employee_name
),

suspect_list AS (
    SELECT employee_name,
        number_of_mistakes
    FROM error_count
WHERE number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count)
)

SELECT employee_name,
    location_id,
    statements
FROM Incorrect_records
WHERE employee_name in (SELECT employee_name FROM suspect_list)
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Bello Azibo', 'KiRu29290', 'A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.'),
 ('Bello Azibo', 'KiHa22748', "A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system."),
 ('Bello Azibo', 'KiRu27884', "A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community."),
 ('Zuriel Matembo', 'KiZu31170', 'A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","'),
 ('Bello Azibo', 'AkRu06495', 'A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","')]

# Integrated Project Maji Ndogo Part 4

### Task 1: Joining pieces together

In [106]:
%%sql

SELECT l.province_name,
    l.town_name,
    v.visit_count,
    v.location_id
FROM location l
INNER JOIN visits v
ON l.location_id = v.location_id
WHERE v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Sokoto', 'Ilanga', 1, 'SoIl32582'),
 ('Kilimani', 'Rural', 1, 'KiRu28935'),
 ('Hawassa', 'Rural', 1, 'HaRu19752'),
 ('Akatsi', 'Lusaka', 1, 'AkLu01628'),
 ('Akatsi', 'Rural', 1, 'AkRu03357')]

In [107]:
%%sql

SELECT l.province_name,
    l.town_name,
    v.visit_count,
    v.location_id,
    ws.type_of_water_source,
    ws.number_of_people_served
FROM location l
INNER JOIN visits v
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
ORDER BY v.location_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Harare', 1, 'AkHa00000', 'tap_in_home', 956),
 ('Akatsi', 'Harare', 1, 'AkHa00001', 'tap_in_home_broken', 930),
 ('Akatsi', 'Harare', 1, 'AkHa00002', 'tap_in_home_broken', 486),
 ('Akatsi', 'Harare', 1, 'AkHa00003', 'well', 364),
 ('Akatsi', 'Harare', 1, 'AkHa00004', 'tap_in_home_broken', 942)]

In [108]:
%%sql

SELECT l.province_name,
    l.town_name,
    v.visit_count,
    v.location_id,
    ws.type_of_water_source,
    ws.number_of_people_served
FROM location l
INNER JOIN visits v
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.location_id = "AkHa00103"
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Harare', 1, 'AkHa00103', 'shared_tap', 3340),
 ('Akatsi', 'Harare', 2, 'AkHa00103', 'shared_tap', 3340),
 ('Akatsi', 'Harare', 3, 'AkHa00103', 'shared_tap', 3340),
 ('Akatsi', 'Harare', 4, 'AkHa00103', 'shared_tap', 3340),
 ('Akatsi', 'Harare', 5, 'AkHa00103', 'shared_tap', 3340)]

In [109]:
%%sql

SELECT l.province_name,
    l.town_name,
    v.visit_count,
    v.location_id,
    ws.type_of_water_source,
    ws.number_of_people_served
FROM location l
INNER JOIN visits v
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.visit_count = 1
ORDER BY v.location_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Harare', 1, 'AkHa00000', 'tap_in_home', 956),
 ('Akatsi', 'Harare', 1, 'AkHa00001', 'tap_in_home_broken', 930),
 ('Akatsi', 'Harare', 1, 'AkHa00002', 'tap_in_home_broken', 486),
 ('Akatsi', 'Harare', 1, 'AkHa00003', 'well', 364),
 ('Akatsi', 'Harare', 1, 'AkHa00004', 'tap_in_home_broken', 942)]

In [110]:
%%sql

SELECT l.province_name,
    l.town_name,
    ws.type_of_water_source,
    l.location_type,
    ws.number_of_people_served,
    v.time_in_queue
FROM location l
INNER JOIN visits v
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Sokoto', 'Ilanga', 'river', 'Urban', 402, 15),
 ('Kilimani', 'Rural', 'well', 'Rural', 252, 0),
 ('Hawassa', 'Rural', 'shared_tap', 'Rural', 542, 62),
 ('Akatsi', 'Lusaka', 'well', 'Urban', 210, 0),
 ('Akatsi', 'Rural', 'shared_tap', 'Rural', 2598, 28)]

In [111]:
%%sql

SELECT ws.type_of_water_source,
    l.town_name,
    l.province_name,
    l.location_type,
    ws.number_of_people_served,
    v.time_in_queue,
    wp.results
FROM visits v
LEFT JOIN well_pollution wp
ON wp.source_id = v.source_id
INNER JOIN location l
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.visit_count = 1
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('river', 'Ilanga', 'Sokoto', 'Urban', 402, 15, None),
 ('well', 'Rural', 'Kilimani', 'Rural', 252, 0, 'Contaminated: Biological'),
 ('shared_tap', 'Rural', 'Hawassa', 'Rural', 542, 62, None),
 ('well', 'Lusaka', 'Akatsi', 'Urban', 210, 0, 'Contaminated: Biological'),
 ('shared_tap', 'Rural', 'Akatsi', 'Rural', 2598, 28, None)]

In [44]:
%%sql

CREATE VIEW combined_analysis_table AS
    SELECT ws.type_of_water_source AS source_type,
        l.town_name,
        l.province_name,
        l.location_type,
        ws.number_of_people_served AS people_served,
        v.time_in_queue,
        wp.results
FROM visits v
LEFT JOIN well_pollution wp
ON wp.source_id = v.source_id
INNER JOIN location l
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.visit_count = 1;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
(pymysql.err.OperationalError) (1050, "Table 'combined_analysis_table' already exists")
[SQL: CREATE VIEW combined_analysis_table AS
    SELECT ws.type_of_water_source AS source_type,
        l.town_name,
        l.province_name,
        l.location_type,
        ws.number_of_people_served AS people_served,
        v.time_in_queue,
        wp.results
FROM visits v
LEFT JOIN well_pollution wp
ON wp.source_id = v.source_id
INNER JOIN location l
ON l.location_id = v.location_id
INNER JOIN water_source ws
ON ws.source_id = v.source_id
WHERE v.visit_count = 1;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Task 2: The last analysis

In [45]:
%%sql

WITH province_totals AS (
    SELECT province_name,
        SUM(people_served) AS total_ppl_serv
    FROM combined_analysis_table
    GROUP BY province_name
    )

SELECT ct.province_name,
    ROUND((SUM(CASE WHEN source_type = 'river'
    THEN people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS river,
    ROUND((SUM(CASE WHEN source_type = 'shared_tap'
    THEN people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS shared_tap,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home'
    THEN people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home_broken'
    THEN people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home_broken,
    ROUND((SUM(CASE WHEN source_type = 'well'
    THEN people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS well
FROM combined_analysis_table ct
INNER JOIN province_totals pt ON ct.province_name = pt.province_name
GROUP BY ct.province_name
ORDER BY ct.province_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', Decimal('5'), Decimal('49'), Decimal('14'), Decimal('10'), Decimal('23')),
 ('Amanzi', Decimal('3'), Decimal('38'), Decimal('28'), Decimal('24'), Decimal('7')),
 ('Hawassa', Decimal('4'), Decimal('43'), Decimal('15'), Decimal('15'), Decimal('24')),
 ('Kilimani', Decimal('8'), Decimal('47'), Decimal('13'), Decimal('12'), Decimal('20')),
 ('Sokoto', Decimal('21'), Decimal('38'), Decimal('16'), Decimal('10'), Decimal('15'))]

In [112]:
%%sql

WITH town_totals AS (
    SELECT province_name,
        town_name,
        SUM(people_served) AS total_ppl_serv
    FROM combined_analysis_table
    GROUP BY province_name,town_name
    )

SELECT ct.province_name,
    ct.town_name,
    ROUND((SUM(CASE WHEN source_type = 'river'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS river,
    ROUND((SUM(CASE WHEN source_type = 'shared_tap'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS shared_tap,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home_broken'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home_broken,
    ROUND((SUM(CASE WHEN source_type = 'well'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS well
FROM combined_analysis_table ct
INNER JOIN town_totals tt
ON ct.province_name = tt.province_name
    AND ct.town_name = tt.town_name
GROUP BY ct.province_name,
    ct.town_name
ORDER BY ct.town_name
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amanzi', 'Abidjan', Decimal('2'), Decimal('53'), Decimal('22'), Decimal('19'), Decimal('4')),
 ('Kilimani', 'Amara', Decimal('8'), Decimal('22'), Decimal('25'), Decimal('16'), Decimal('30')),
 ('Amanzi', 'Amina', Decimal('8'), Decimal('24'), Decimal('3'), Decimal('56'), Decimal('9')),
 ('Hawassa', 'Amina', Decimal('2'), Decimal('14'), Decimal('19'), Decimal('24'), Decimal('42')),
 ('Amanzi', 'Asmara', Decimal('3'), Decimal('49'), Decimal('24'), Decimal('20'), Decimal('4'))]

In [47]:
%%sql

CREATE TEMPORARY TABLE town_aggregated_water_access
WITH town_totals AS (
    SELECT province_name,
        town_name,
        SUM(people_served) AS total_ppl_serv
    FROM combined_analysis_table
    GROUP BY province_name,
        town_name
    )
SELECT ct.province_name,
    ct.town_name,
    ROUND((SUM(CASE WHEN source_type = 'river'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS river,
    ROUND((SUM(CASE WHEN source_type = 'shared_tap'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS shared_tap,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home,
    ROUND((SUM(CASE WHEN source_type = 'tap_in_home_broken'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home_broken,
    ROUND((SUM(CASE WHEN source_type = 'well'
    THEN people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS well
FROM combined_analysis_table ct
INNER JOIN town_totals tt 
ON ct.province_name = tt.province_name
    AND ct.town_name = tt.town_name
GROUP BY ct.province_name,
    ct.town_name
ORDER BY ct.town_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
31 rows affected.

[]

In [113]:
%%sql

SELECT *
FROM town_aggregated_water_access
ORDER BY province_name
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Lusaka', Decimal('2'), Decimal('17'), Decimal('28'), Decimal('28'), Decimal('26')),
 ('Akatsi', 'Kintampo', Decimal('2'), Decimal('15'), Decimal('31'), Decimal('26'), Decimal('26')),
 ('Akatsi', 'Harare', Decimal('2'), Decimal('17'), Decimal('28'), Decimal('27'), Decimal('27')),
 ('Akatsi', 'Rural', Decimal('6'), Decimal('59'), Decimal('9'), Decimal('5'), Decimal('22')),
 ('Amanzi', 'Amina', Decimal('8'), Decimal('24'), Decimal('3'), Decimal('56'), Decimal('9'))]

In [114]:
%%sql

SELECT province_name,
    town_name,
    ROUND(tap_in_home_broken / (tap_in_home_broken + tap_in_home) * 100,0) AS Pct_broken_taps
FROM town_aggregated_water_access
ORDER BY Pct_broken_taps DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amanzi', 'Amina', Decimal('95')),
 ('Kilimani', 'Zuri', Decimal('65')),
 ('Hawassa', 'Amina', Decimal('56')),
 ('Hawassa', 'Djenne', Decimal('55')),
 ('Kilimani', 'Rural', Decimal('53'))]

### Task 3,4: Summary report - A practical plan

In [76]:
%%sql

DROP TABLE IF EXISTS Project_progress;

CREATE TABLE Project_progress (
    Project_id SERIAL PRIMARY KEY,
    source_id VARCHAR(20) NOT NULL REFERENCES water_source(source_id) ON DELETE CASCADE ON UPDATE CASCADE,
    Address VARCHAR(50),
    Town VARCHAR(30),
    Province VARCHAR(30),
    Source_type VARCHAR(50),
    Improvement VARCHAR(50),
    Source_status VARCHAR(50) DEFAULT 'Backlog' CHECK (Source_status IN ('Backlog', 'In progress', 'Complete')),
    Date_of_completion DATE,
    Comments TEXT
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.
0 rows affected.

[]

In [115]:
%%sql

SELECT l.address,
    l.town_name,
    l.province_name,
    ws.source_id,
    ws.type_of_water_source,
    wp.results
FROM water_source ws
LEFT JOIN well_pollution wp
ON ws.source_id = wp.source_id
INNER JOIN visits v
ON ws.source_id = v.source_id
INNER JOIN location l
ON l.location_id = v.location_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('2 Addis Ababa Road', 'Harare', 'Akatsi', 'AkHa00000224', 'tap_in_home', None),
 ('10 Addis Ababa Road', 'Harare', 'Akatsi', 'AkHa00001224', 'tap_in_home_broken', None),
 ('9 Addis Ababa Road', 'Harare', 'Akatsi', 'AkHa00002224', 'tap_in_home_broken', None),
 ('139 Addis Ababa Road', 'Harare', 'Akatsi', 'AkHa00003224', 'well', 'Clean'),
 ('17 Addis Ababa Road', 'Harare', 'Akatsi', 'AkHa00004224', 'tap_in_home_broken', None)]

In [116]:
%%sql
    
SELECT l.address,
    l.town_name,
    l.province_name,
    ws.source_id,
    ws.type_of_water_source,
    wp.results,
    CASE
        WHEN wp.results = 'Contaminated: Biological' THEN 'Install UV filter and RO filter'
        WHEN wp.results = 'Contaminated: Chemical' THEN 'Install RO filter'
        WHEN ws.type_of_water_source = 'river' THEN 'Drill well'
        WHEN ws.type_of_water_source = 'shared_tap' 
            AND v.time_in_queue >= 30 THEN CONCAT("Install ", FLOOR(v.time_in_queue / 30), " taps nearby")
        WHEN ws.type_of_water_source = 'tap_in_home_broken' THEN 'Diagnose local infrastructure'
        ELSE NULL
    END AS Improvement
FROM water_source ws
LEFT JOIN well_pollution wp
ON ws.source_id = wp.source_id
INNER JOIN visits v
ON ws.source_id = v.source_id
INNER JOIN location l
ON l.location_id = v.location_id
WHERE v.visit_count = 1
    AND ( wp.results != 'Clean'
        OR ws.type_of_water_source IN ('tap_in_home_broken', 'river')
        OR (ws.type_of_water_source = 'shared_tap'
                AND v.time_in_queue >= 30)
    )
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('36 Pwani Mchangani Road', 'Ilanga', 'Sokoto', 'SoIl32582224', 'river', None, 'Drill well'),
 ('129 Ziwa La Kioo Road', 'Rural', 'Kilimani', 'KiRu28935224', 'well', 'Contaminated: Biological', 'Install UV filter and RO filter'),
 ('18 Mlima Tazama Avenue', 'Rural', 'Hawassa', 'HaRu19752224', 'shared_tap', None, 'Install 2 taps nearby'),
 ('100 Mogadishu Road', 'Lusaka', 'Akatsi', 'AkLu01628224', 'well', 'Contaminated: Biological', 'Install UV filter and RO filter'),
 ('26 Bahari Ya Faraja Road', 'Rural', 'Kilimani', 'KiRu29315224', 'river', None, 'Drill well')]

In [77]:
%%sql

INSERT INTO 
    Project_progress(source_id, Address, Town, Province, Source_type, Improvement)

        SELECT ws.source_id,
        l.address,
        l.town_name AS Town,
        l.province_name AS Province,
        ws.type_of_water_source AS Source_type,
        CASE
            WHEN wp.results = 'Contaminated: Biological' THEN 'Install UV filter and RO filter'
            WHEN wp.results = 'Contaminated: Chemical' THEN 'Install RO filter'
            WHEN ws.type_of_water_source = 'river' THEN 'Drill well'
            WHEN ws.type_of_water_source = 'shared_tap' 
                AND v.time_in_queue >= 30 THEN CONCAT("Install ", FLOOR(v.time_in_queue / 30), " taps nearby")
            WHEN ws.type_of_water_source = 'tap_in_home_broken' THEN 'Diagnose local infrastructure'
            ELSE NULL
        END AS Improvement
        FROM water_source ws
        LEFT JOIN well_pollution wp
        ON ws.source_id = wp.source_id
        INNER JOIN visits v
            ON ws.source_id = v.source_id
        INNER JOIN location l
            ON l.location_id = v.location_id
        WHERE v.visit_count = 1
            AND ( wp.results != 'Clean'
                    OR ws.type_of_water_source IN ('tap_in_home_broken', 'river')
                    OR (ws.type_of_water_source = 'shared_tap'
                            AND v.time_in_queue >= 30)
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
25398 rows affected.

[]

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>